
// clang-format off
#include "pch.h"
#include "includes/menu_main.h"
// clang-format on

#define IMGUI_BITFIELD(s, item)                                                \
  {                                                                            \
    bool bs = item->s;                                                         \
    if (ImGui::Checkbox(#s, &bs))                                              \
      item->s = bs;                                                            \
  }

void MenuMain::Init() {
  // AddItem(config.GetADunDefPlayerController()->myHero->HeroEquipments[0]);
}

void MenuMain::OnBegin() {
  ImGui::Begin("MainMenu");

  // for (auto item : itemsVec) {
  // item.Render();
  //}
}

void MenuMain::RenderMenuButton(std::string name, std::function<void()> func,
                                bool isSelected) {
  ImVec4 selectedColor = isSelected
                             ? ImGui::GetStyle().Colors[ImGuiCol_ButtonActive]
                             : ImGui::GetStyle().Colors[ImGuiCol_Button];

  float avalibleWidth = ImGui::GetContentRegionAvail().x;
  ImVec2 buttonSize(avalibleWidth, 30.0f);

  ImGui::PushStyleColor(ImGuiCol_Button, selectedColor);
  if (ImGui::Button(name.c_str(), buttonSize))
    func();
  ImGui::PopStyleColor();
}

int MenuMain::GetKeydown() {
  ImGuiIO &io = ImGui::GetIO();
  ImGuiKey start_key = ImGuiKey_NamedKey_BEGIN;
  for (ImGuiKey key = start_key; key < ImGuiKey_NamedKey_END;
       key = (ImGuiKey)(key + 1)) {

      auto pPlayerPawn = config.GetADunDefPlayerController();
      if (config.bNoClip) {
        if (pPlayerPawn) {
          pPlayerPawn->Pawn->bCollideWorld = false;
          pPlayerPawn->Pawn->bCollideActors = false;
          pPlayerPawn->Pawn->bCollideComplex = false;
          pPlayerPawn->Pawn->GravityZMultiplier = 0;
        }
      } else {
        if (pPlayerPawn) {
          pPlayerPawn->Pawn->GravityZMultiplier = 1;
          pPlayerPawn->Pawn->bCollideWorld = true;
          pPlayerPawn->Pawn->bCollideActors = true;
          pPlayerPawn->Pawn->bCollideComplex = true;
        }
      }
    }

    ImGui::InputFloat("No clip speed", &config.fNoClipSpeed);

    // level cheats
    ImGui::InputInt("##waveskip", &config.waveToSkipTo);
    ImGui::SameLine();
    ImGui::Checkbox("Level skip", &config.bSkipWave);
    ImGui::SameLine();
    ImGui::Checkbox("lock level", &config.bLockWave);
  }

  // multiply rewards
  ImGui::InputInt("##reward count", &config.MultiplyRewardsBy);
  ImGui::SameLine();
  ImGui::Checkbox("Multiply Wave rewards", &config.bMultiplyReward);

  // teleport cheats
  {
    ImGui::Separator();
    /* Vacuum cheats */
    if (ImGui::Button("Update vacuum pos")) {
      config.SetVacPos(config.GetPlayerPos());
    }

    // Vacuum point is done in postrender
    ImGui::Checkbox("Show vacuum point", &config.bShowVacuumPos);
    ImGui::Checkbox("Vacuum hack", &config.bVacHack);
    ImGui::Separator();

    /* teleport cheats */
    if (ImGui::Button("Update teleport pos")) {
      config.SetTeleportPos(config.GetPlayerPos());
    }
    // teleport point is done in postrender
    ImGui::Checkbox("Show teleport pos", &config.bShowPlayerTeleportPos);
    ImGui::Checkbox("Teleport players", &config.bTeleportPlayers);
  }

  // debugging
#ifdef _DEBUG
  Debug();
#endif

  ImGui::PopItemWidth();
}

void MenuMain::PlayerCheats() {
  ImGui::Text("Player Cheats");
  ImGui::Separator();
  Classes::ADunDefPlayerController *pController =
      config.GetADunDefPlayerController();

  if (!pController)
    return;
  // player controller
  {
    // ImGui::InputInt("Player mana", &pController->ManaPower);
    // float vec[3] = {pController->Pawn->Location.X,
    //                 pController->Pawn->Location.Y,
    //                 pController->Pawn->Location.Z};
    // if (ImGui::InputFloat3("Player pos", vec)) {
    //   pController->Pawn->Location.X = vec[0];
    //   pController->Pawn->Location.Y = vec[1];
    //   pController->Pawn->Location.Z = vec[2];
    // }
    // ImGui::InputInt("Score", &pController->Score);

    if (ImGui::Button("Max all towers")) {
      pController->UpgradeAllTowers(5);
    }
    ImGui::SameLine();
    if (ImGui::Button("Repair all towers")) {
      pController->RepairAllTowers();
    }

    if (ImGui::Button("Max shop mana")) {
      Classes::FHighDigitInt tmp = {1, 1, 1, 1};
      pController->SetBankedMana(tmp, 0, 1);
    }
    // TArray<class ADunDefPlayerAbility*>                PlayerAbilities; //
    // 0x097C(0x000C) (NeedCtorLink) TArray<int> statsData; // 0x0654(0x000C)
    // (NeedCtorLink) TArray<int> playerStatsData; // 0x0660(0x000C)
    // (NeedCtorLink) TArray<int> myStatsData; // 0x066C(0x000C) (NeedCtorLink)
    ////
    // void SkipToWave(int Wave);
    // void UpgradeAllTowers(int numLevels);
    // void DowngradeAllTowers(int numLevels);
    // void DropAllMana();
    // void STATIC_DistributeManaAmongPlayers(float ManaAmount, int
    // numRecursions, bool bAllowBanking, bool bOnlyPutInBank); void
    // ClientDoUnlockAchievment(TEnumAsByte<EAchievement> Achievement); void
    // ClientAddManaToBank(float ManaAmount, bool bIgnoreBankLimit); bool
    // AddBankMana(float mana, bool bIgnoreBankLimit, bool bAddFromHeroMana);
    // void StopHovering(); void StartHovering(); void
    // ClientSetUserNickname(const struct FString& NickName);
  }

  if (!pController->myHero)
    return;
  // player hero
  {

    ImGui::InputInt("Hero level", &pController->myHero->HeroLevel);
    ImGui::InputInt("Hero Experience", &pController->myHero->HeroExperience);
    ImGui::InputInt("Mana power", &pController->myHero->ManaPower);
    static float c1[4] = {0, 0, 0, 0};
    static float c2[4] = {0, 0, 0, 0};
    static float c3[4] = {0, 0, 0, 0};

    ImGui::InputFloat4("C1", c1);
    ImGui::InputFloat4("C2", c2);
    ImGui::InputFloat4("C3", c3);

    Classes::FLinearColor cLiner1 = {c1[0], c1[1], c1[2], c1[3]};
    Classes::FLinearColor cLiner2 = {c2[0], c2[1], c2[2], c2[3]};
    Classes::FLinearColor cLiner3 = {c3[0], c3[1], c3[2], c3[3]};

    if (ImGui::Button("Set color")) {
      pController->myHero->SetColors(cLiner1, cLiner2, cLiner3);
    }

    // TArray<class UHeroEquipment*>                      HeroEquipments; //
    // 0x056C(0x000C) (NeedCtorLink)
    // player hero
    //	unsigned long                                      bHasCompleteArmorSet
    //: 1;                                 // 0x004C(0x0004) 	int
    // CurrentCostumeIndex;                                      //
    // 0x0114(0x0004) (Edit) 	TArray<struct FHeroCostumeTemplate>
    // HeroCostumes; // 0x0214(0x000C) (Edit, NeedCtorLink) 	int
    // HeroHealthModifier; // 0x04C0(0x0004) 	int HeroSpeedModifier; //
    // 0x04C4(0x0004) 	int HeroDamageModifier; // 0x04C8(0x0004) 	int
    // HeroCastingModifier; // 0x04CC(0x0004) 	int HeroAbilityOneModifier; //
    // 0x04D0(0x0004) 	int HeroAbilityTwoModifier; // 0x04D4(0x0004) 	int
    // HeroDefenseHealthModifier;                                //
    // 0x04D8(0x0004) 	int HeroDefenseAttackRateModifier; // 0x04DC(0x0004)
    // int HeroDefenseDamageModifier;                                //
    // 0x04E0(0x0004) 	int HeroDefenseAreaOfEffectModifier; // 0x04E4(0x0004)
    //	TArray<class ADunDefTower*>                        HeroTowers; //
    // 0x0578(0x000C) (NeedCtorLink) 	class UHeroEquipment*
    // HeroWeaponEquipment;
    //// 0x0584(0x0004) 	bool IsHeroUnlocked(class ULocalPlayer*
    /// ForPlayer, int*
    // lockedByDemo); 	bool IsCostumeUnlocked(class ULocalPlayer* ForPlayer,
    // int costumeIndex); 	int GetNextUnlockedCostumeIndex(class
    // ULocalPlayer* ForPlayer, int CurrentIndex); 	int
    // GetNumberOfUnlockedCostumes(class ULocalPlayer* ForPlayer); 	void
    // SetName(const struct FString& NewName);
    //	void DoLevelUp(int NumLevelsToAdd, bool dontSaveHero);
    //	void AddExperience(int experience);
    //	bool HeroLevelUp();
    //	bool ReachedLevelCap();
  }

  if (!pController->Pawn)
    return;
  // player pawn
  {
    ImGui::InputInt("Health", &pController->Pawn->Health);
    ImGui::InputInt("Max Health", &pController->Pawn->HealthMax);

    static float loc[3] = {0, 0, 0};
    ImGui::InputFloat3("Position", loc);
    if (ImGui::Button("Update position")) {
      Classes::FVector temp = {loc[0], loc[1], loc[2]};
      pController->Pawn->Location = temp;
    }

